from styles import *
from additional_functions import resource_path

# ==========================================================================
# Пути к файлам
# ==========================================================================

MODELS_DESCRIPTION_FILENAME = "src\\models.json"
MODELS_DIRECTORY_PATH = "src\\models"
STANDARD_TRAIN_DATA_PATH = "src\\data\\Temperature20142024MoscowVDNH.txt"

LOGO_IMAGE_PATH = "src\\assets\\main_logo.png"
TEMPERATURE_ICON_PATH = "src\\assets\\temperature_icon.svg"
CHANGE_ICON_PATH = "src\\assets\\сhange_icon.svg"
CHANGE_ICON_HOVER_PATH = "src\\assets\\сhange_icon_hover.svg"
TRASH_ICON_PATH = "src\\assets\\trash_icon.svg"
TRASH_ICON_HOVER_PATH = "src\\assets\\trash_icon_hover.svg"

# ==========================================================================
# Окно приложения
# ==========================================================================

# Название окна
APP_WINDOW_TITLE = "Предсказание погоды"
APP_TITLE = APP_WINDOW_TITLE  

# Настройки размеров окна
WINDOW_MIN_WIDTH = 900
WINDOW_MIN_HEIGHT = 550
WINDOW_DEFAULT_WIDTH = 1000
WINDOW_DEFAULT_HEIGHT = 660
WINDOW_MAX_WIDTH = 1300
WINDOW_MAX_HEIGHT = 750

# ==========================================================================
# Боковая панель
# ==========================================================================

# Ширина панели
SIDEBAR_WIDTH = 200

# Размер логотипа
LOGO_SIZE = 60

# Температура за текущий месяц
LOADING_LABEL_TEMPLATE = "Загрузка прогноза..."
WEATHER_SUMMARY_LABEL_TEMPLATE = "Средняя температура на {0} 2025 года\n(по стандартной модели):"
TEMP_ICON_SIZE = 50

# Темы приложения
THEMES = {
    "misty_sunrise": ("Туманный\nвосход", MISTY_SUNRISE_THEME),
    "daylight_mountains": ("Дневные\nгоры", DAYLIGHT_MOUNTAINS_THEME),
    "pink_dawn": ("Розовый\nрассвет", PINK_DAWN_THEME),
}

# ==========================================================================
# Вкладка "Модели"
# ==========================================================================

MODELS_TAB_NAME = "Модели"

# Размеры карточек моделей
MODEL_CARD_WIDTH = 220
MODEL_CARD_HEIGHT = 150

# Названия кнопок карточек моделей
TRAIN_BUTTON_TEXT = "Обучить"
PREDICT_BUTTON_TEXT = "Предсказать"

# Информация о стандартной модели
STANDARD_MODEL_ID = "bc60fe9b-68a6-41cc-8b86-39cf66bf0af4"
STANDARD_MODEL_NAME = "Стандартная модель"
STANDARD_MODEL_DESCRIPTION = "Это стандартная модель для теста приложения"

# Информация о незаполненной модели
DEFAULT_MODEL_NAME = "Без имени"
DEFAULT_DESCRIPTION = "К сожалению, эта модель не имеет описания"

# Сообщения при взаимодействии со стандартной моделью
STANDARD_MODEL_ISNT_READY = "Стандартная модель пока не обучена"
WEATHER_SUMMARY_CANT_DISPLAY = "Прогноз недоступен: стандартная модель не готова"

# Кнопка внизу вкладки для добавления новых моделей
LOAD_MODEL_WINDOW_TITLE = "Добавить модель"

# ==========================================================================
# Диалоговые окна
# ==========================================================================

# Настройки размеров
DIALOG_WIDTH = 350
DIALOG_HEIGHT = 250

TRAIN_DIALOG_HEIGHT = 200

# Размеры иконок взаимодейсивия с окнами
BUTTON_SIZE = 30

# Окно изменения имени модели
CHANGE_NAME_WINDOW_TITLE = "Новое имя и описание модели"
CHANGE_NAME_WINDOW_TEXT = "Новое имя:"

# Окно добавления новой модели
ADD_MODEL_WINDOW_TITLE = "Загрузка новой модели"

# Текст окна
ADD_MODEL_NAME_TITLE = "Введите имя модели:"
ADD_MODEL_NAME_PLACEHOLDER = "Введите текст..."
ADD_MODEL_DESCRIPTION_TITLE ="Описание:"
ADD_MODEL_DESCRIPTION_PLACEHOLDER = "Введите описание..."

# ==========================================================================
# Окно обучения модели
# ==========================================================================

# Название окна
TRAIN_MODE_WINDOW_TITLE = "Обучение модели"

# Предупреждение об использовании своего файла
TRAIN_MODE_QUESTION = "Если вы хотите использовать свой файл, то ваш " \
"файл должен иметь 2 колонки:\n" \
"• 'timestamp' / 'Местное время в Москве (ВДНХ)'\n" \
"• 'T' (температура)"

# Выбор данных для обучения
STANDARD_TRAIN_MODE_TITLE = "Использовать стандартный набор"
FILE_TRAIN_MODE_TITLE = "Использовать свой файл"

# Названия окна выбора файла обучения (при выборе второго варианта)
TRAIN_FILE_WINDOW_TITLE = "Выбор файла для обучения"

# Выбор количества эпох обучения
EPOCH_INPUT_TITLE = "Количество эпох:"
EPOCHS_DEFAULT_VALUE = "100" # Количество эпох по умолчанию

# Кнопка
START_TRAIN_BUTTON_TEXT = "Начать обучение"

# ==========================================================================
# Вкладка модели с обучением
# ==========================================================================

# Заголовок
TRAIN_WINDOW_TITLE = "Обучение модели"

# Сообщения сверху
TRAIN_WAITING_LABEL_TEXT = "Происходит обучение модели. Пожалуйста, ожидайте"

TRAIN_DONE_LABEL_TEXT = "Спасибо за ожидание, обучение завершено! \n" \
"Обученная модель сохранена во внутренних файлах программы.\n\n" \
"Вы можете дополнительно сохранить её на жесткий диск"

# Подпись графика
LOSS_CHART_SUBTITLE = "График потерь"

EVALUATE_RESULT_TEXT = "Средняя абсолютная ошибка: {0}\nСредняя квадратичная ошибка: {1}"

# Кнопка сохранения модели на жесткий диск
SAVE_BUTTON_TEXT = "Сохранить обученную модель"

# Названия окна сохранения модели на жесткий диск
SAVE_MODEL_WINDOW_TITLE = "Сохранение файла модели"

# ==========================================================================
# Окно предсказания модели
# ==========================================================================

# Название окна 
INPUT_YEAR_WINDOW_TITLE = "Выбор года предсказания"

INPUT_YEAR_VALUE_FROM = 2025 # Минимально допустимая дата предсказания
INPUT_YEAR_VALUE_TO = 2030 # Максимально допустимая дата предсказания

# Текст окна
INPUT_YEAR_TITLE = "Ввведите год от {0} до {1}:"
INPUT_YEAR_PLACEHOLDER = "Например, 2025"

# ==========================================================================
# Вкладка модели с предсказанием
# ==========================================================================

# Заголовок
PREDICT_WINDOW_SUBTITLE_TEMPLATE = "Погода на {0} год"

# Сообщения об ошибке
ERROR_LABEL_TEXT = "Не удалось загрузить модель"

# Цвет графиков
WHITE_COLOR_DIAGRAMS = "#E0E7FF"

# Подпись оси Y
PREDICTED_TEMPERATURE_YLABEL = "Температура (°C)"

# Месяцы для предсказания
MONTHS_NAME = [
    "Январь",
    "Февраль",
    "Март",
    "Апрель",
    "Май",
    "Июнь",
    "Июль",
    "Август",
    "Сентябрь",
    "Октябрь",
    "Ноябрь",
    "Декабрь"
]

# Кнопка для сохранения предсказния
SAVE_RESULT_BUTTON = "Сохранить результат"

# Названия окна для сохранения предсказния
SAVE_RESULT_WINDOW_TITLE = "Сохранения результата предсказания"

# ==========================================================================
# Прочие настройки
# ==========================================================================

# Стандартный оступ
RESIZE_MARGIN = 5

# Кнопки "OK" и "Отменить"
OK_BUTTON_TEXT = "Готово"
CANCEL_BUTTON_TEXT = "Отмена"